<a href="https://colab.research.google.com/github/VeraaaaWei/data_analytics/blob/Python/1.14.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd
import numpy as np

In [24]:
df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/BL-Flickr-Images-Book.csv')

In [14]:
#Exploratory Data Analysis

#shape - the total number of rows and columns in an array (Rows, Column)
#head - the top 5 rows
#tail - the bottom 5 rows
#describe - statistics of the dataset.

In [11]:
df.shape

(8287, 15)

In [9]:
df.head()

   Identifier  ...                           Shelfmarks
0         206  ...    British Library HMNTS 12641.b.30.
1         216  ...    British Library HMNTS 12626.cc.2.
2         218  ...    British Library HMNTS 12625.dd.1.
3         472  ...  British Library HMNTS 10369.bbb.15.
4         480  ...     British Library HMNTS 9007.d.28.

[5 rows x 15 columns]

In [12]:
df.tail()

      Identifier  ...                                         Shelfmarks
8282     4158088  ...  British Library HMNTS|British Library HMNTS 10...
8283     4158128  ...  British Library HMNTS|British Library HMNTS 10...
8284     4159563  ...  British Library HMNTS|British Library HMNTS 19...
8285     4159587  ...  British Library HMNTS|British Library HMNTS 10...
8286     4160339  ...  British Library HMNTS|British Library HMNTS 79...

[5 rows x 15 columns]

In [13]:
df.describe()

         Identifier  Corporate Author  Corporate Contributors  Engraver
count  8.287000e+03               0.0                     0.0       0.0
mean   2.017344e+06               NaN                     NaN       NaN
std    1.190379e+06               NaN                     NaN       NaN
min    2.060000e+02               NaN                     NaN       NaN
25%    9.157875e+05               NaN                     NaN       NaN
50%    2.043707e+06               NaN                     NaN       NaN
75%    3.047430e+06               NaN                     NaN       NaN
max    4.160339e+06               NaN                     NaN       NaN

In [15]:
df.columns

Index(['Identifier', 'Edition Statement', 'Place of Publication',
       'Date of Publication', 'Publisher', 'Title', 'Author', 'Contributors',
       'Corporate Author', 'Corporate Contributors', 'Former owner',
       'Engraver', 'Issuance type', 'Flickr URL', 'Shelfmarks'],
      dtype='object')

In [37]:
column_to_be_dropped = ['Edition Statement','Corporate Author','Corporate Contributors', 'Former owner', 'Engraver']
type(column_to_be_dropped)

list

In [41]:
new_df = df.drop(column_to_be_dropped, axis = 1)
new_df.head()

   Identifier  ...                           Shelfmarks
0         206  ...    British Library HMNTS 12641.b.30.
1         216  ...    British Library HMNTS 12626.cc.2.
2         218  ...    British Library HMNTS 12625.dd.1.
3         472  ...  British Library HMNTS 10369.bbb.15.
4         480  ...     British Library HMNTS 9007.d.28.

[5 rows x 10 columns]

In [40]:
new_df['Identifier'].is_unique
book_reindexed_df = new_df.set_index('Identifier')
book_reindexed_df.head()

                Place of Publication  ...                           Shelfmarks
Identifier                            ...
206                           London  ...    British Library HMNTS 12641.b.30.
216         London; Virtue & Yorston  ...    British Library HMNTS 12626.cc.2.
218                           London  ...    British Library HMNTS 12625.dd.1.
472                           London  ...  British Library HMNTS 10369.bbb.15.
480                           London  ...     British Library HMNTS 9007.d.28.

[5 rows x 9 columns]

In [42]:
book_reindexed_df['Date of Publication'].str.isnumeric()

Identifier
206        False
216         True
218         True
472         True
480         True
           ...
4158088     True
4158128    False
4159563    False
4159587     True
4160339    False
Name: Date of Publication, Length: 8287, dtype: object

In [43]:
book_reindexed_df.loc[206]

Place of Publication                                               London
Date of Publication                                           1879 [1878]
Publisher                                                S. Tinsley & Co.
Title                                   Walter Forbes. [A novel.] By A. A
Author                                                              A. A.
Contributors                                              FORBES, Walter.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks                              British Library HMNTS 12641.b.30.
Name: 206, dtype: object

In [44]:
book_reindexed_df.loc[4158128]

Place of Publication                                                Derby
Date of Publication                                              1831, 32
Publisher                                                 M. Mozley & Son
Title                   The History and Gazetteer of the County of Der...
Author                                         GLOVER, Stephen - of Derby
Contributors                                               NOBLE, Thomas.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks              British Library HMNTS|British Library HMNTS 10...
Name: 4158128, dtype: object

In [45]:
book_reindexed_df.loc[4159563]

Place of Publication                                               London
Date of Publication                                             [1806]-22
Publisher                                         T. Cadell and W. Davies
Title                   Magna Britannia; being a concise topographical...
Author                  LYSONS, Daniel - M.A., F.R.S., and LYSONS (Sam...
Contributors                     GREGSON, Matthew.|LYSONS, Samuel - F.R.S
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks              British Library HMNTS|British Library HMNTS 19...
Name: 4159563, dtype: object

In [46]:
book_reindexed_df.loc[216]

Place of Publication                             London; Virtue & Yorston
Date of Publication                                                  1868
Publisher                                                    Virtue & Co.
Title                   All for Greed. [A novel. The dedication signed...
Author                                                          A., A. A.
Contributors                 BLAZE DE BURY, Marie Pauline Rose - Baroness
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks                              British Library HMNTS 12626.cc.2.
Name: 216, dtype: object

In [51]:
regex = r'^(\d{4})'
book_reindexed_df['Date of Publication'] = book_reindexed_df['Date of Publication'].str.extract(regex, expand = False)
book_reindexed_df['Date of Publication']

Identifier
206        1879
216        1868
218        1869
472        1851
480        1857
           ...
4158088    1838
4158128    1831
4159563     NaN
4159587    1834
4160339    1834
Name: Date of Publication, Length: 8287, dtype: object

In [53]:
book_reindexed_df.head()

                Place of Publication  ...                           Shelfmarks
Identifier                            ...
206                           London  ...    British Library HMNTS 12641.b.30.
216         London; Virtue & Yorston  ...    British Library HMNTS 12626.cc.2.
218                           London  ...    British Library HMNTS 12625.dd.1.
472                           London  ...  British Library HMNTS 10369.bbb.15.
480                           London  ...     British Library HMNTS 9007.d.28.

[5 rows x 9 columns]

In [54]:
property_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv')

In [55]:
property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [56]:
property_df.shape

(9, 7)

In [58]:
property_df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [60]:
property_df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [61]:
property_df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [62]:
property_df['ST_NUM'].isnull().count()

9

In [63]:
property_df['NUM_BATH'] = pd.to_numeric(property_df['NUM_BATH'],errors = 'coerce')
property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0   LEXINGTON            N            3       1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0    BERKELEY           12            1       NaN   700
4          NaN   203.0    BERKELEY            Y            3       2.0  1600
5  100006000.0   207.0    BERKELEY            Y          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN            2       NaN   950
7  100008000.0   213.0     TREMONT            Y            1       1.0   NaN
8  100009000.0   215.0     TREMONT            Y           na       2.0  1800

In [66]:
new_prop_df = property_df.dropna()
new_prop_df

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
8  100009000.0   215.0    TREMONT            Y           na       2.0  1800

In [76]:
missing_values = ['-','--','na','n/a','NA']
property_na_fix_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv', na_values=missing_values)

property_na_fix_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [77]:
property_na_fix_df['NUM_BEDROOMS'].is_unique

False

In [78]:
property_na_fix_df['SQ_FT'].dtype

dtype('float64')

In [86]:
property_na_fix_df['PROP_TYPE'] = np.where((property_na_fix_df['SQ_FT'] > 1000),'BIG','SMALL')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT PROP_TYPE
0  100001000.0   104.0      PUTNAM  ...        1  1000.0     SMALL
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN     SMALL
2  100003000.0     NaN   LEXINGTON  ...        1   850.0     SMALL
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0     SMALL
4          NaN   203.0    BERKELEY  ...        2  1600.0       BIG
5  100006000.0   207.0    BERKELEY  ...        1   800.0     SMALL
6  100007000.0     NaN  WASHINGTON  ...   HURLEY   950.0     SMALL
7  100008000.0   213.0     TREMONT  ...        1     NaN     SMALL
8  100009000.0   215.0     TREMONT  ...        2  1800.0       BIG

[9 rows x 8 columns]

In [89]:
property_na_fix_df['PROP_TYPE'] = np.where((property_na_fix_df['SQ_FT'].isna() == False),property_na_fix_df['SQ_FT'], 'Unknown')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT PROP_TYPE
0  100001000.0   104.0      PUTNAM  ...        1  1000.0    1000.0
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN   Unknown
2  100003000.0     NaN   LEXINGTON  ...        1   850.0     850.0
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0     700.0
4          NaN   203.0    BERKELEY  ...        2  1600.0    1600.0
5  100006000.0   207.0    BERKELEY  ...        1   800.0     800.0
6  100007000.0     NaN  WASHINGTON  ...   HURLEY   950.0     950.0
7  100008000.0   213.0     TREMONT  ...        1     NaN   Unknown
8  100009000.0   215.0     TREMONT  ...        2  1800.0    1800.0

[9 rows x 8 columns]

In [92]:
new_prop_df

new_prop_df_BR = new_prop_df['NUM_BEDROOMS'].fillna(5, inplace = False)
new_prop_df_BR

0     3
1     3
8    na
Name: NUM_BEDROOMS, dtype: object